src/Catalogs/ИТСервисы_ИТСервисы/ИТСервисы_ИТСервисы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИТСервисы_ИТСервисы</name>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТехПровайдер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>РуководительСервиса</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗапуска</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВывода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Активен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийСервис</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Развитие</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Сопровождение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланПроектаВИСУП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодВАРМРазработчика</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/ИТСервисы_ИТСервисы/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    ОбработатьВидимостьКонтрагента();
    ОбработатьВидимостьДатыВывода();
КонецПроцедуры

&НаКлиенте
Процедура ВнешнийСервисПриИзменении(Элемент)
    ОбработатьВидимостьКонтрагента();
КонецПроцедуры

&НаКлиенте
Процедура АктивенПриИзменении(Элемент)
    ОбработатьВидимостьДатыВывода();
КонецПроцедуры

&НаСервере
Процедура ОбработатьВидимостьКонтрагента()
    Если НЕ Объект.ВнешнийСервис Тогда
        Объект.ТехПровайдер = Справочники.Контрагенты.ПустаяСсылка();
    КонецЕсли;
    Элементы.ТехПровайдер.Видимость = Объект.ВнешнийСервис;
КонецПроцедуры

&НаСервере
Процедура ОбработатьВидимостьДатыВывода()
    Если Объект.Активен Тогда
        Объект.ДатаВывода = Дата(1, 1, 1);
    КонецЕсли;
    Элементы.ДатаВывода.Видимость = НЕ Объект.Активен;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
    Если Объект.ДатаВывода <> Дата(1, 1, 1) И Объект.ДатаВывода < Объект.ДатаЗапуска Тогда
        Отказ = Истина;
        Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = "Дата вывода не может быть меньше даты запуска!";
        Сообщение.Сообщить();
    КонецЕсли;
КонецПроцедуры
